{
    "needsErrorInfo": false,
    "mobileBottomRow": 17,
    "widgetName": "DEXCFIELD",
    "displayName": "Text",
    "iconSVG": "/static/media/icon.a47d6d5dbbb718c4dc4b2eb4f218c1b7.svg",
    "searchTags": [
        "typography",
        "paragraph",
        "label"
    ],
    "topRow": 13,
    "bottomRow": 104,
    "parentRowSpace": 10,
    "type": "TEXT_WIDGET",
    "hideCard": false,
    "mobileRightColumn": 36,
    "animateLoading": true,
    "overflow": "NONE",
    "fontFamily": "{{appsmith.theme.fontFamily.appFont}}",
    "parentColumnSpace": 16.046875,
    "dynamicTriggerPathList": [],
    "leftColumn": 20,
    "dynamicBindingPathList": [
        {"key": "truncateButtonColor"},
        {"key": "fontFamily"},
        {"key": "borderRadius"}
    ],
    "shouldTruncate": false,
    "truncateButtonColor": "{{appsmith.theme.colors.primaryColor}}",
    "text": "Biography: Mary Bishop has been an Academic Coordinator at Stanford for seven years. She has a true passion for organization, collaboration, and education, and she loves playing a large role in helping the Computer Science department provide a positive experience for its students. Prior to being an Academic Coordinator, Mary worked as an assistant professor in data science where she taught courses on introductory programming and machine learning. She is also an advisor for the Women in Technology student organization at Stanford, and is a strong advocate for more diverse representation in the tech industry. \n\nAge: 39\t\t\t\t\t\t\t\t\n\nGender: Female\n\nOccupation: Academic Coordinator (College of Information and Computer Sciences)\n\nHobbies: Running, cooking, learning new languages, spending time with her husband and two kids\n\nLikes: \nCross-collaboration between departments in her role at Stanford\nBackend, operational nature of her position\nInteracting with students and answering their questions\nKeeping up with new developments in the tech industry and seeking ways to implement them into current curriculum to stay relevant\nAdvocating for DEI in tech\n\nDislikes:\nExcessive amounts of administrative work with no tangible student impact\nPlanning the scheduling of course sections each semester\nDealing with technical difficulties in course platforms and registration she is assigned to fix\nLimited opportunities to interact directly with students in her current position\nConducting performance evaluations for professors every semester based on student feedback\nCombing through lots of excess information to gather data that supports her ideas for the future of the department\n",
    "key": "gdv3yz7rst",
    "isDeprecated": false,
    "rightColumn": 64,
    "textAlign": "LEFT",
    "dynamicHeight": "AUTO_HEIGHT",
    "widgetId": "cpcymvo7n9",
    "minWidth": 450,
    "isVisible": true,
    "fontStyle": "",
    "textColor": "#231F20",
    "version": 1,
    "parentId": "0",
    "tags": [
        "Suggested",
        "Content"
    ],
    "renderMode": "CANVAS",
    "isLoading": false,
    "mobileTopRow": 13,
    "responsiveBehavior": "fill",
    "originalTopRow": 13,
    "borderRadius": "{{appsmith.theme.borderRadius.appBorderRadius}}",
    "mobileLeftColumn": 20,
    "maxDynamicHeight": 9000,
    "originalBottomRow": 104,
    "fontSize": "1rem",
    "minDynamicHeight": 4
}